knai_11 = {
    "Monday": {
        "not_even": "9:35, каб. 6308: Системне програмування та архітектура комп'ютерів, викладач Осолінський Олександр Романович\n11:10, каб. 6308: Вища математика, викладач Алілуйко Андрій Миколайович\n12:50, каб. 6308: Фізика, викладач Паздрій Ігор Ростиславович",
        "pair": "9:35, каб. 6308: Системне програмування та архітектура комп'ютерів, викладач Осолінський Олександр Романович\n11:10, каб. 6308: Вища математика, викладач Алілуйко Андрій Миколайович\n12:50, каб. 6308: Фізика, викладач Паздрій Ігор Ростиславович"
    },
    "Tuesday": {
        "not_even": "8:00, каб. 6104: Сучасні парадигми програмування, викладач Биковий Павло Євгенович\n9:35, каб. 6104: Дискретна математика, викладачка Мартинюк Олеся Миронівна" ,
        "pair":"8:00, каб. 6104: Сучасні парадигми програмування, викладач Биковий Павло Євгенович\n9:35, каб. 6104: Дискретна математика, викладачка Мартинюк Олеся Миронівна\n12:50, актовий зал (1 корпус): Політологія, викладач Томахів Володимир Ярославович" 
    },
    "Wednesday": {
        "not_even": "9:35, каб. 6303: Системне програмування та архітектура комп'ютерів, викладач Кіт Іван Романович\n11:10, каб. 6301: Вища математика, викладач Алілуйко Андрій Миколайович\n12:50, каб. 6302: Фізика, викладач Дериш Богдан Богданович",
        "pair": "11:10, каб. 6301: Вища математика, викладач Алілуйко Андрій Миколайович\n12:50, каб. 6302: Фізика, викладач Дериш Богдан Богданович"
    },
    "Thursday": {
        "not_even": "12:50, каб. 5508: Іноземна мова, викладачка Штохман Лілія Миколаївна\n14:25, каб. 5509: Сучасні парадигми програмування, викладач Кіт Іван Романович",
        "pair": "11:10, каб. 5506: Політологія, викладач Томахів Володимир Ярославович\n12:50, каб. 5508: Іноземна мова, викладачка Штохман Лілія Миколаївна\n14:25, каб. 5509: Сучасні парадигми програмування, викладач Кіт Іван Романович"
    },
    "Friday": {
        "not_even": "12:50, каб. 5505: Дискретна математика, викладачка Мартинюк Олеся Миронівна\n14:25, каб. 5501: Системне програмування та архітектура комп'ютерів, Викладач: Кіт Іван Романович",
        "pair": "12:50, каб. 5505: Дискретна математика, викладачка Мартинюк Олеся Миронівна\n14:25, каб. 5501: Системне програмування та архітектура комп'ютерів, Викладач: Кіт Іван Романович"
    },
}
kn_11 = {
    "Monday": {
        "not_even": "9:35, каб. 6308: Системне програмування та архітектура комп'ютерів, викладач Осолінський Олександр Романович\n11:10, каб. 6308: Вища математика, викладач Алілуйко Андрій Миколайович\n12:50, каб. 6308: Фізика, викладач Паздрій Ігор Ростиславович",
        "pair": "9:35, каб. 6308: Системне програмування та архітектура комп'ютерів, викладач Осолінський Олександр Романович\n11:10, каб. 6308: Вища математика, викладач Алілуйко Андрій Миколайович\n12:50, каб. 6308: Фізика, викладач Паздрій Ігор Ростиславович"
    },
    "Tuesday": {
        "not_even": "8:00, каб. 6104: Сучасні парадигми програмування, викладач Биковий Павло Євгенович\n9:35, каб. 6104: Дискретна математика, викладачка Мартинюк Олеся Миронівна" ,
        "pair":"8:00, каб. 6104: Сучасні парадигми програмування, викладач Биковий Павло Євгенович\n9:35, каб. 6104: Дискретна математика, викладачка Мартинюк Олеся Миронівна\n12:50, актовий зал (1 корпус): Політологія, викладач Томахів Володимир Ярославович" 
    },
    "Wednesday": {
        "not_even": "9:35, каб. 6303: Системне програмування та архітектура комп'ютерів, викладач Кіт Іван Романович\n11:10, каб. 6301: Вища математика, викладач Алілуйко Андрій Миколайович\n12:50, каб. 6302: Фізика, викладач Дериш Богдан Богданович",
        "pair": "9:35, каб. 6303: Системне програмування та архітектура комп'ютерів, викладач Кіт Іван Романович\n11:10, каб. 6301: Вища математика, викладач Алілуйко Андрій Миколайович\n12:50, каб. 6302: Фізика, викладач Дериш Богдан Богданович"
    },
    "Thursday": {
        "not_even": "8:00, каб. 5509: Сучасні парадигми програмування, викладач Кіт Іван Романович\n9:35, каб. 5509: Сучасні парадигми програмування, викладач Кіт Іван Романович\n11:10, каб. 5508: Іноземна мова, викладачка Рибачок Світлана Михайлівна",
        "pair": "8:00, каб. 5509: Сучасні парадигми програмування, викладач Кіт Іван Романович\n9:35, каб. 5509: Сучасні парадигми програмування, викладач Кіт Іван Романович\n11:10, каб. 5508: Іноземна мова, викладачка Рибачок Світлана Михайлівна\n12:50, каб. 5506: Політологія, викладач Томахів Володимир Ярославович"
    },
    "Friday": {
        "not_even": "8:00, каб. 5501: Системне програмування та архітектура комп'ютерів, викладач Кіт Іван Романович\n9:35, каб. 5501: Системне програмування та архітектура комп'ютерів, Викладач: Кіт Іван Романович\n11:10, каб. 5505: Дискретна математика, викладачка Мартинюк Олеся Миронівна",
        "pair": "8:00, каб. 5501: Системне програмування та архітектура комп'ютерів, викладач Кіт Іван Романович\n9:35, каб. 5501: Системне програмування та архітектура комп'ютерів, Викладач: Кіт Іван Романович\n11:10, каб. 5505: Дискретна математика, викладачка Мартинюк Олеся Миронівна"
    },
}
kn_12 = {
    "Monday": {
        "not_even": "9:35, каб. 6308: Системне програмування та архітектура комп'ютерів, викладач Осолінський Олександр Романович\n11:10, каб. 6308: Вища математика, викладач Алілуйко Андрій Миколайович\n12:50, каб. 6308: Фізика, викладач Паздрій Ігор Ростиславович",
        "pair": "9:35, каб. 6308: Системне програмування та архітектура комп'ютерів, викладач Осолінський Олександр Романович\n11:10, каб. 6308: Вища математика, викладач Алілуйко Андрій Миколайович\n12:50, каб. 6308: Фізика, викладач Паздрій Ігор Ростиславович"
    },
    "Tuesday": {
        "not_even": "8:00, каб. 6104: Сучасні парадигми програмування, викладач Биковий Павло Євгенович\n9:35, каб. 6104: Дискретна математика, викладачка Мартинюк Олеся Миронівна" ,
        "pair":"8:00, каб. 6104: Сучасні парадигми програмування, викладач Биковий Павло Євгенович\n9:35, каб. 6104: Дискретна математика, викладачка Мартинюк Олеся Миронівна\n12:50, актовий зал (1 корпус): Політологія, викладач Томахів Володимир Ярославович" 
    },
    "Wednesday": {
        "not_even": "11:10, каб. 6404: Системне програмування та архітектура комп'ютерів, викладач Кіт Іван Романович\n12:50, каб. 6301: Вища математика, викладач: Алілуйко Андрій Миколайович\n14:25, каб. 6302 Фізика, викладач Паздрій Ігор Ростиславович",
        "pair": "11:10, каб. 6404: Системне програмування та архітектура комп'ютерів, викладач Кіт Іван Романович\n12:50, каб. 6301: Вища математика, викладач: Алілуйко Андрій Миколайович\n14:25, каб. 6302 Фізика, викладач Паздрій Ігор Ростиславович"
    },
    "Thursday": {
        "not_even": "11:10, каб. 5509: Сучасні парадигми програмування, викладач Кіт Іван Романович\n12:50, каб. 5509: Сучасні парадигми програмування, викладач Кіт Іван Романович\n14:25, каб. 5508:Іноземна мова, викладачка: П’ятничка Тетяна Василівна",
        "pair": "9:35, каб. 5506: Політологія, викладач Томахів Володимир Ярославович\n11:10, каб. 5509: Сучасні парадигми програмування, викладач Кіт Іван Романович\n12:50, каб. 5509: Сучасні парадигми програмування, викладач Кіт Іван Романович\n14:25, каб. 5508:Іноземна мова, викладачка: П’ятничка Тетяна Василівна"
    },
    "Friday": {
        "not_even": "11:10, каб. 5501: Системне програмування та архітектура комп'ютерів, викладач Кіт Іван Романович\n12:50, каб. 5501: Системне програмування та архітектура комп'ютерів, Викладач: Кіт Іван Романович\n14:25, каб. 5505: Дискретна математика, Викладачка: Мартинюк Олеся Миронівна",
        "pair": "11:10, каб. 5501: Системне програмування та архітектура комп'ютерів, викладач Кіт Іван Романович\n12:50, каб. 5501: Системне програмування та архітектура комп'ютерів, Викладач: Кіт Іван Романович\n14:25, каб. 5505: Дискретна математика, Викладачка: Мартинюк Олеся Миронівна"
    },
}