def information(info, bot):
    bot.reply_to(info, "Версія: 1.2.3 [Adolf]\n"
                 "Батько: Павло Іванчук (@pashan_channel)\n"
                  "Радник щодо ідеї та хороший ITшник)): Вороняк Богдан\n"
                  "Автор ідеї: Юра (Пробач, просто не знаю твого прізвища :()\n"
                  "Телеграм канал: @fcithelper\n"
                  "\n"
                  "Спасибі старостам КНШІ-11, КН-11 та КН-12 за доставлений розклад. Ви сильно допомогли розвити бота в кращу сторону :)\n"
                  "Окрема подяка Віталію Шевчуку за доставлений розклад та Dead Hunter за прекрасні ідеї, та за допомогу створити розклад :)\n")