def updates_info(updates, bot):
    bot.reply_to(updates, "Обновлення 31.04 1.0.0 [Adolf] Release\n"+
                 "- Додана команда /info\n"
                 "- Додана команда /schedules, /schedule, /sched, /sc\n"
                 "- Змінені шляхи до модулів для компактності\n"
                 "- Додані віртуальні кнопки, якщо студент введе команду /schedule, то йому запропонує вибрати групу в якому він навчається\n"
                 "----------------\n"
                 "Обновлення 16.03 0.0.69 [Invalid] Beta\n"+
                 "- Доданий розклад для КНШІ-11 та частково КН-11\n"+
                 "- Додані команди /knai_11 та /kn_11")
    
def lupdates_info(lupdates, bot):
    bot.reply_to(lupdates, "Обновлення 31.04 1.0.0 [Adolf] Release\n"+
                 "- Додана команда /info\n"
                 "- Додана команда /schedules, /schedule, /sched, /sc\n"
                 "- Змінені шляхи до модулів для компактності\n"
                 "- Додані віртуальні кнопки, якщо студент введе команду /schedule, то йому запропонує вибрати групу в якому він навчається\n")